Security/demo/src/main/resources/register.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:gs="http://localhost:8080/demo/gen">
  <soapenv:Header/>
  <soapenv:Body>
    <gs:getRegistrationRequest>
      <gs:email>foo@bar.baz</gs:email>
      <gs:password>rootsecret</gs:password>
    </gs:getRegistrationRequest>
  </soapenv:Body>
</soapenv:Envelope>